#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_zone.kacpermalachowski: Refreshing state... [id=719d0307f56dd61e2a0a1a06f8c3a6e5]
google_project_service.firestore: Refreshing state... [id=blog-395007/firestore.googleapis.com]
google_artifact_registry_repository.api: Refreshing state... [id=projects/blog-395007/locations/europe-central2/repositories/blog-api]
google_artifact_registry_repository.website: Refreshing state... [id=projects/blog-395007/locations/europe-central2/repositories/blog-website]
google_firestore_database.database: Refreshing state... [id=projects/blog-395007/databases/(default)]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.api_record will be created
  + resource "cloudflare_record" "api_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_record.api_www_record will be created
  + resource "cloudflare_record" "api_www_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www.api"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_record.website_record will be created
  + resource "cloudflare_record" "website_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # cloudflare_record.website_www_record will be created
  + resource "cloudflare_record" "website_www_record" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "719d0307f56dd61e2a0a1a06f8c3a6e5"
    }

  # google_cloud_run_v2_service.api_server will be created
  + resource "google_cloud_run_v2_service" "api_server" {
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-central2"
      + name                    = "api-server"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "europe-central2-docker.pkg.dev/blog-395007/blog-api"
            }
        }
    }

  # google_cloud_run_v2_service.website will be created
  + resource "google_cloud_run_v2_service" "website" {
      + conditions              = (known after apply)
      + etag                    = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-central2"
      + name                    = "website"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "europe-central2-docker.pkg.dev/blog-395007/blog-website"
            }
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @KacperMalachowski, Action: `pull_request`*